function main() {
  var textArea = document.getElementById("textArea").value;
  var data = textArea.replace(/\r\n|\r|\n/g, " ").split(' ');  

  var eew = decode(data);

  document.getElementById('result').innerText = '';
  document.getElementById('result').innerText += '電文種別　' + eew.title + '\n';
  document.getElementById('result').innerText += '発信官署　' + eew.office + '\n';
  document.getElementById('result').innerText += '電文の種類　' + eew.status + '\n';
  document.getElementById('result').innerText += '発信時刻　' + eew.reportTime + '\n';
  document.getElementById('result').innerText += '地震発生時刻　' + eew.targetTime + '\n';
  document.getElementById('result').innerText += '地震識別番号　' + eew.eventID + '\n';
  if (data[7].substr(0, 4) != 'NCPN') {
    document.getElementById('result').innerText += '発表状況の指示　' + eew.infoType + '\n';
  }
  document.getElementById('result').innerText += '情報番号　' + eew.serial + '\n';
  if (data[0] != '35' && data[0] != '36' && data[0] != '37') return;  
  document.getElementById('result').innerText += '震央地名　' + eew.epicenter + '\n';
  document.getElementById('result').innerText += '震源の緯度　' + eew.latitude + '\n';
  document.getElementById('result').innerText += '震源の経度　' + eew.longitude + '\n';
  document.getElementById('result').innerText += '震源の深さ　' + eew.depth + 'km\n';  
  document.getElementById('result').innerText += 'マグニチュード　' + eew.magnitude + '\n';  
  document.getElementById('result').innerText += '最大予測震度　' + eew.intensity + '\n';  
  document.getElementById('result').innerText += '震央の確からしさ　' + eew.accuracyEpicenter + '\n';  
  document.getElementById('result').innerText += '震源の深さの確からしさ　' + eew.accuracyDepth + '\n';  
  document.getElementById('result').innerText += 'マグニチュードの確からしさ　' + eew.magnitudeCalculation + '\n';  
  document.getElementById('result').innerText += 'マグニチュード使用観測点　' + eew.numberOfMagnitudeCalculation + '\n';  
  document.getElementById('result').innerText += '震源の確からしさ　' + eew.accuracyHypocenter + '\n'; 
  document.getElementById('result').innerText += '震央位置の海陸判定　' + eew.landOrSea + '\n';
  document.getElementById('result').innerText += '警報発表対象の識別符　' + eew.warn + '\n';
  document.getElementById('result').innerText += '最大予測震度の変化　' + eew.maxIntChange + '\n';
  document.getElementById('result').innerText += '最大予測震度の変化の理由　' + eew.maxIntChangeReason + '\n';

  document.getElementById('result').innerText += '\n';
  for (var i = 0, len = eew.ebi.length; i < len; i += 5) {
    document.getElementById('result').innerText += eew.ebi[i] + '　';
    document.getElementById('result').innerText += eew.ebi[i + 1] + '　';
    document.getElementById('result').innerText += eew.ebi[i + 3] + '　';
    document.getElementById('result').innerText += eew.ebi[i + 4] + '　';
    document.getElementById('result').innerText += eew.ebi[i + 2] + '\n';
  }
}

function decode(data) {
  var eew = new Object();

  function toDateStr(str) {
    return '20' + str.substr(0, 2) + '年' + str.substr(2, 2) + '月' + str.substr(4, 2) + '日' +
    str.substr(6, 2) + '時' + str.substr(8, 2) + '分' + str.substr(10, 2) + '秒';
  }
  
  function toIntensity(str) {
    if (str == '//') {
      return '不明・未設定、キャンセル';
    } else if (str.substr(0, 1) == '0') {
      return Number(str);
    } else {
      return str.replace('-', '弱').replace('+', '強');
    }
  }

  eew.title = { 
    '35': '最大予測震度のみの緊急地震速報（発表パターン1）',
    '36': 'マグニチュード、最大予測震度及び主要動到達予測時刻の緊急地震速報（発表パターン2）',
    '37': 'マグニチュード、最大予測震度及び主要動到達予測時刻の緊急地震速報（発表パターン3）',
    '38': 'テスト電文',
    '39': 'キャンセル（取り消し）情報',
    '47': '一般向け緊急地震速報',
    '48': 'キャンセル報',
    '61': 'リアルタイム震度'
  }[data[0]];

  eew.office = {
    '01': '札幌管区気象台',
    '02': '仙台管区気象台',
    '03': '気象庁本庁',
    '04': '大阪管区気象台',
    '05': '福岡管区気象台'
  }[data[1]];

  eew.status = {
    '00': '通常',
    '01': '訓練',
    '10': '通常の取り消し',
    '11': '訓練の取り消し',
    '20': '参考情報またはテスト電文',
    '30': 'コード部全体の配信試験'
  }[data[2]];

  eew.reportTime = toDateStr(data[3]);

  eew.targetTime = toDateStr(data[5]);

  eew.eventID = data[6].replace('ND', '');
  
  eew.infoType = {
    '0': '通常発表',
    '6': '情報内容を訂正',
    '7': 'キャンセルを誤って発表した場合の訂正',
    '8': '訂正事項を盛り込んだ最終の緊急地震速報（予報）',
    '9': '最終の緊急地震速報（予報）',
    '/': '未設定'
  }[data[7].substr(3, 1)];

  eew.serial = function(str) {
    var serial;
    var tens = str.charCodeAt(0);
    var ones = str.charCodeAt(1);
    if (tens >= '0'.charCodeAt(0) && tens <= '9'.charCodeAt(0)) {
      serial = tens - '0'.charCodeAt(0) + str.substr(1, 1);
    } else if (tens >= 'A'.charCodeAt(0) && tens <= 'Z'.charCodeAt(0)) {
      serial = tens - 'A'.charCodeAt(0) + 10 + str.substr(1, 1);
    }
    return Number(serial);
  }(data[7].substr(4, 2));

  eew.epicenter = {
    '011': '北海道地方',
    '012': '東北地方',
    '013': '北陸地方',
    '014': '関東甲信地方',
    '015': '小笠原地方',
    '016': '東海地方',
    '017': '近畿地方',
    '018': '中国地方',
    '019': '四国地方',
    '020': '九州地方',
    '021': '沖縄地方',
    '100': '石狩地方北部',
    '101': '石狩地方中部',
    '102': '石狩地方南部',
    '105': '渡島地方北部',
    '106': '渡島地方東部',
    '107': '渡島地方西部',
    '110': '檜山地方',
    '115': '後志地方北部',
    '116': '後志地方東部',
    '117': '後志地方西部',
    '120': '空知地方北部',
    '121': '空知地方中部',
    '122': '空知地方南部',
    '125': '上川地方北部',
    '126': '上川地方中部',
    '127': '上川地方南部',
    '130': '留萌地方中北部',
    '131': '留萌地方南部',
    '135': '宗谷地方北部',
    '136': '宗谷地方南部',
    '140': '網走地方',
    '141': '北見地方',
    '142': '紋別地方',
    '145': '胆振地方西部',
    '146': '胆振地方中東部',
    '150': '日高地方西部',
    '151': '日高地方中部',
    '152': '日高地方東部',
    '155': '十勝地方北部',
    '156': '十勝地方中部',
    '157': '十勝地方南部',
    '160': '釧路地方北部',
    '161': '釧路地方中南部',
    '165': '根室地方北部',
    '166': '根室地方中部',
    '167': '根室地方南部',
    '180': '北海道南西沖',
    '181': '北海道西方沖',
    '182': '石狩湾',
    '183': '北海道北西沖',
    '184': '宗谷海峡',
    '186': '国後島付近',
    '187': '択捉島付近',
    '188': '北海道東方沖',
    '189': '根室半島南東沖',
    '190': '釧路沖',
    '191': '十勝沖',
    '192': '浦河沖',
    '193': '苫小牧沖',
    '194': '内浦湾',
    '195': '宗谷東方沖',
    '196': '網走沖',
    '197': '択捉島南東沖',
    '200': '青森県津軽北部',
    '201': '青森県津軽南部',
    '202': '青森県三八上北地方',
    '203': '青森県下北地方',
    '210': '岩手県沿岸北部',
    '211': '岩手県沿岸南部',
    '212': '岩手県内陸北部',
    '213': '岩手県内陸南部',
    '220': '宮城県北部',
    '221': '宮城県南部',
    '222': '宮城県中部',
    '230': '秋田県沿岸北部',
    '231': '秋田県沿岸南部',
    '232': '秋田県内陸北部',
    '233': '秋田県内陸南部',
    '240': '山形県庄内地方',
    '241': '山形県最上地方',
    '242': '山形県村山地方',
    '243': '山形県置賜地方',
    '250': '福島県中通り',
    '251': '福島県浜通り',
    '252': '福島県会津',
    '280': '津軽海峡',
    '281': '山形県沖',
    '282': '秋田県沖',
    '283': '青森県西方沖',
    '284': '陸奥湾',
    '285': '青森県東方沖',
    '286': '岩手県沖',
    '287': '宮城県沖',
    '288': '三陸沖',
    '289': '福島県沖',
    '300': '茨城県北部',
    '301': '茨城県南部',
    '309': '千葉県南東沖',
    '310': '栃木県北部',
    '311': '栃木県南部',
    '320': '群馬県北部',
    '321': '群馬県南部',
    '330': '埼玉県北部',
    '331': '埼玉県南部',
    '332': '埼玉県秩父地方',
    '340': '千葉県北東部',
    '341': '千葉県北西部',
    '342': '千葉県南部',
    '349': '房総半島南方沖',
    '350': '東京都２３区',
    '351': '東京都多摩東部',
    '352': '東京都多摩西部',
    '360': '神奈川県東部',
    '361': '神奈川県西部',
    '370': '新潟県上越地方',
    '371': '新潟県中越地方',
    '372': '新潟県下越地方',
    '378': '新潟県下越沖',
    '379': '新潟県上中越沖',
    '380': '富山県東部',
    '381': '富山県西部',
    '390': '石川県能登地方',
    '391': '石川県加賀地方',
    '400': '福井県嶺北',
    '401': '福井県嶺南',
    '411': '山梨県中・西部',
    '412': '山梨県東部・富士五湖',
    '420': '長野県北部',
    '421': '長野県中部',
    '422': '長野県南部',
    '430': '岐阜県飛騨地方',
    '431': '岐阜県美濃東部',
    '432': '岐阜県美濃中西部',
    '440': '静岡県伊豆地方',
    '441': '静岡県東部',
    '442': '静岡県中部',
    '443': '静岡県西部',
    '450': '愛知県東部',
    '451': '愛知県西部',
    '460': '三重県北部',
    '461': '三重県中部',
    '462': '三重県南部',
    '469': '三重県南東沖',
    '471': '茨城県沖',
    '472': '関東東方沖',
    '473': '千葉県東方沖',
    '475': '八丈島東方沖',
    '476': '八丈島近海',
    '477': '東京湾',
    '478': '相模湾',
    '480': '伊豆大島近海',
    '481': '伊豆半島東方沖',
    '482': '三宅島近海',
    '483': '新島・神津島近海',
    '485': '駿河湾',
    '486': '駿河湾南方沖',
    '487': '遠州灘',
    '489': '三河湾',
    '490': '伊勢湾',
    '492': '若狭湾',
    '493': '福井県沖',
    '494': '石川県西方沖',
    '495': '能登半島沖',
    '497': '富山湾',
    '498': '佐渡付近',
    '499': '東海道南方沖',
    '500': '滋賀県北部',
    '501': '滋賀県南部',
    '510': '京都府北部',
    '511': '京都府南部',
    '520': '大阪府北部',
    '521': '大阪府南部',
    '530': '兵庫県北部',
    '531': '兵庫県南東部',
    '532': '兵庫県南西部',
    '540': '奈良県',
    '550': '和歌山県北部',
    '551': '和歌山県南部',
    '560': '鳥取県東部',
    '562': '鳥取県中部',
    '563': '鳥取県西部',
    '570': '島根県東部',
    '571': '島根県西部',
    '580': '岡山県北部',
    '581': '岡山県南部',
    '590': '広島県北部',
    '591': '広島県南東部',
    '592': '広島県南西部',
    '600': '徳島県北部',
    '601': '徳島県南部',
    '610': '香川県東部',
    '611': '香川県西部',
    '620': '愛媛県東予',
    '621': '愛媛県中予',
    '622': '愛媛県南予',
    '630': '高知県東部',
    '631': '高知県中部',
    '632': '高知県西部',
    '673': '土佐湾',
    '674': '紀伊水道',
    '675': '大阪湾',
    '676': '播磨灘',
    '677': '瀬戸内海中部',
    '678': '安芸灘',
    '679': '周防灘',
    '680': '伊予灘',
    '681': '豊後水道',
    '682': '山口県北西沖',
    '683': '島根県沖',
    '684': '鳥取県沖',
    '685': '隠岐島近海',
    '686': '兵庫県北方沖',
    '687': '京都府沖',
    '688': '淡路島付近',
    '689': '和歌山県南方沖',
    '700': '山口県北部',
    '702': '山口県西部',
    '703': '山口県東部',
    '704': '山口県中部',
    '710': '福岡県福岡地方',
    '711': '福岡県北九州地方',
    '712': '福岡県筑豊地方',
    '713': '福岡県筑後地方',
    '720': '佐賀県北部',
    '721': '佐賀県南部',
    '730': '長崎県北部',
    '731': '長崎県南西部',
    '732': '長崎県島原半島',
    '740': '熊本県阿蘇地方',
    '741': '熊本県熊本地方',
    '742': '熊本県球磨地方',
    '743': '熊本県天草・芦北地方',
    '750': '大分県北部',
    '751': '大分県中部',
    '752': '大分県南部',
    '753': '大分県西部',
    '760': '宮崎県北部平野部',
    '761': '宮崎県北部山沿い',
    '762': '宮崎県南部平野部',
    '763': '宮崎県南部山沿い',
    '770': '鹿児島県薩摩地方',
    '771': '鹿児島県大隅地方',
    '783': '五島列島近海',
    '784': '天草灘',
    '785': '有明海',
    '786': '橘湾',
    '787': '鹿児島湾',
    '790': '種子島近海',
    '791': '日向灘',
    '793': '奄美大島近海',
    '795': '壱岐・対馬近海',
    '796': '福岡県北西沖',
    '797': '薩摩半島西方沖',
    '798': 'トカラ列島近海',
    '799': '奄美大島北西沖',
    '820': '大隅半島東方沖',
    '821': '九州地方南東沖',
    '822': '種子島南東沖',
    '823': '奄美大島北東沖',
    '850': '沖縄本島近海',
    '851': '南大東島近海',
    '852': '沖縄本島南方沖',
    '853': '宮古島近海',
    '854': '石垣島近海',
    '855': '石垣島南方沖',
    '856': '西表島付近',
    '857': '与那国島近海',
    '858': '沖縄本島北西沖',
    '859': '宮古島北西沖',
    '860': '石垣島北西沖',
    '900': '台湾付近',
    '901': '東シナ海',
    '902': '四国沖',
    '903': '鳥島近海',
    '904': '鳥島東方沖',
    '905': 'オホーツク海南部',
    '906': 'サハリン西方沖',
    '907': '日本海北部',
    '908': '日本海中部',
    '909': '日本海西部',
    '911': '父島近海',
    '912': '千島列島',
    '913': '千島列島南東沖',
    '914': '北海道南東沖',
    '915': '東北地方東方沖',
    '916': '小笠原諸島西方沖',
    '917': '硫黄島近海',
    '918': '小笠原諸島東方沖',
    '919': '南海道南方沖',
    '920': '薩南諸島東方沖',
    '921': '本州南方沖',
    '922': 'サハリン南部付近',
    '930': '北西太平洋',
    '932': 'マリアナ諸島',
    '933': '黄海',
    '934': '朝鮮半島南部',
    '935': '朝鮮半島北部',
    '936': '中国東北部',
    '937': 'ウラジオストク付近',
    '938': 'シベリア南部',
    '939': 'サハリン近海',
    '940': 'アリューシャン列島',
    '941': 'カムチャツカ半島付近',
    '942': '北米西部',
    '943': '北米中部',
    '944': '北米東部',
    '945': '中米',
    '946': '南米西部',
    '947': '南米中部',
    '948': '南米東部',
    '949': '北東太平洋',
    '950': '南太平洋',
    '951': 'インドシナ半島付近',
    '952': 'フィリピン付近',
    '953': 'インドネシア付近',
    '954': 'グアム付近',
    '955': 'ニューギニア付近',
    '956': 'ニュージーランド付近',
    '957': 'オーストラリア付近',
    '958': 'シベリア付近',
    '959': 'ロシア西部',
    '960': 'ロシア中部',
    '961': 'ロシア東部',
    '962': '中央アジア',
    '963': '中国西部',
    '964': '中国中部',
    '965': '中国東部',
    '966': 'インド付近',
    '967': 'インド洋',
    '968': '中東',
    '969': 'ヨーロッパ西部',
    '970': 'ヨーロッパ中部',
    '971': 'ヨーロッパ東部',
    '972': '地中海',
    '973': 'アフリカ西部',
    '974': 'アフリカ中部',
    '975': 'アフリカ東部',
    '976': '北大西洋',
    '977': '南大西洋',
    '978': '北極付近',
    '979': '南極付近',
    '999': '遠地',
    '///': 'キャンセル'
  }[data[10]];

  eew.latitude = function(str) {
    switch (str.substr(0, 1)) {
      case 'N':
        return '北緯' + (str.substr(1, 3) / 10).toFixed(1) + '度';
      case 'S':
        return '南緯' + (str.substr(1, 3) / 10).toFixed(1) + '度';
      case '/':
        return 'キャンセル';
    }
  }(data[11]);

  eew.longitude = function(str) {
    switch (str.substr(0, 1)) {
      case 'E':
        return '東経' + (str.substr(1, 4) / 10).toFixed(1) + '度';
      case 'W':
        return '西経' + (str.substr(1, 4) / 10).toFixed(1) + '度';
      case '/':
        return 'キャンセル';
    }
  }(data[12]);

  eew.depth = function(str) {
    if (str == '///') {
      return '不明・未設定、キャンセル';
    } else {
      return Number(str);
    }
  }(data[13]);

  eew.magnitude = function(str) {
    if (str == '//') {
      return '不明・未設定、キャンセル';
    } else {
      return str.substr(0, 2) / 10;
    }
  }(data[14]);

  eew.intensity = toIntensity(data[15]);

  eew.accuracyEpicenter = {
    '1': 'P波／S波レベル越え、IPF法（1点）、または仮定震源要素',
    '2': 'IPF法（2点）',
    '3': 'IPF法（3点／4点）',
    '4': 'IPF法（5点以上）',
    '5': '防災科研システム（4点以下、または精度情報なし）〔防災科学技術研究所データ〕',
    '6': '防災科研システム（5点以上）〔防災科学技術研究所データ〕',
    '7': 'EPOS（海域〔観測網外〕）',
    '8': 'EPOS（内陸〔観測網内〕）',
    '9': '予備',
    '/': '不明、未設定、キャンセル'
  }[data[16].substr(2, 1)];

  eew.accuracyDepth = {
    '1': 'P波／S波レベル越え、IPF法（1点）、または仮定震源要素',
    '2': 'IPF法（2点）',
    '3': 'IPF法（3点／4点）',
    '4': 'IPF法（5点以上）',
    '5': '防災科研システム（4点以下、または精度情報なし）〔防災科学技術研究所データ〕',
    '6': '防災科研システム（5点以上）〔防災科学技術研究所データ〕',
    '7': 'EPOS（海域〔観測網外〕）',
    '8': 'EPOS（内陸〔観測網内〕）',
    '9': '予備',
    '/': '不明、未設定、キャンセル'
  }[data[16].substr(3, 1)];

  eew.magnitudeCalculation = {
    '2': '防災科研システム〔防災科学技術研究所データ〕',
    '3': '全点P相',
    '4': 'P相／全相混在',
    '5': '全点全相',
    '6': 'EPOS',
    '8': 'P波／S波レベル越え、または仮定震源要素',
    '9': '予備',
    '/': '不明、未設定、キャンセル'
  }[data[16].substr(4, 1)];
  
  eew.numberOfMagnitudeCalculation = {
    '1': '1点、P波／S波レベル越え、または仮定震源要素',
    '2': '2点',
    '3': '3点',
    '4': '4点',
    '5': '5点以上',
    '6': '未使用',
    '7': '未使用',
    '8': '未使用',
    '9': '未使用',
    '/': '不明、未設定、キャンセル'
  }[data[16].substr(5, 1)];

  eew.accuracyHypocenter = {
    '1': 'P波／S波レベル越え、IPF法（1点）、または仮定震源要素',
    '2': 'IPF法（2点）',
    '3': 'IPF法（3点／4点）',
    '4': 'IPF法（5点以上）',
    '5': '未使用',
    '6': '未使用',
    '7': '未使用',
    '8': '未使用',
    '9': '震源とマグニチュードに基づく震度予測手法の精度が最終報相当',
    '/': '不明、未設定、キャンセル'
  }[data[16].substr(6, 1)];

  eew.landOrSea = {
    '0': '内陸',
    '1': '海域',
    '/': '不明、未設定、キャンセル、または仮定震源要素'
  }[data[17].substr(2, 1)];

  eew.warn = {
    '0': '予報',
    '1': '警報',
    '/': '不明、未設定、キャンセル'
  }[data[17].substr(3, 1)];

  eew.prediction = {
    '9': '震源とマグニチュードによる震度推定手法において震源要素が推定できず、PLUM法による震度予測のみが有効',
    '/': '不明、未設定、キャンセル'
  }[data[17].substr(4, 1)]

  eew.maxIntChange = {
    '0': 'ほとんど変化なし',
    '1': '最大予測震度が1.0以上大きくなった',
    '2': '最大予測震度が1.0以上小さくなった',
    '/': '不明、未設定、キャンセル'
  }[data[18].substr(2, 1)];

  eew.maxIntChangeReason = {
    '0': '変化なし',
    '1': '主としてＭが変化したため（1.0以上）',
    '2': '主として震央位置が変化したため（10.0km以上）',
    '3': 'Ｍ及び震央位置が変化したため（1と2の複合条件）',
    '4': '震源の深さが変化したため（上記のいずれにもあてはまらず、30.0km以上変化）',
    '9': 'PLUM法による予測により変化したため',
    '/': '不明、未設定、キャンセル'  
  }[data[18].substr(3, 1)];
  
  eew.ebi = [];
  for (var i = 20, len = data.length; i < len; i += 4) {
    if (data[i] == '9999=') break;

    eew.ebi.push({
      '100': '石狩地方北部',
      '101': '石狩地方中部',
      '102': '石狩地方南部',
      '105': '渡島地方北部',
      '106': '渡島地方東部',
      '107': '渡島地方西部',
      '110': '檜山地方',
      '115': '後志地方北部',
      '116': '後志地方東部',
      '117': '後志地方西部',
      '119': '北海道奥尻島',
      '120': '空知地方北部',
      '121': '空知地方中部',
      '122': '空知地方南部',
      '125': '上川地方北部',
      '126': '上川地方中部',
      '127': '上川地方南部',
      '130': '留萌地方中北部',
      '131': '留萌地方南部',
      '135': '宗谷地方北部',
      '136': '宗谷地方南部',
      '139': '北海道利尻礼文',
      '140': '網走地方',
      '141': '北見地方',
      '142': '紋別地方',
      '145': '胆振地方西部',
      '146': '胆振地方中東部',
      '150': '日高地方西部',
      '151': '日高地方中部',
      '152': '日高地方東部',
      '155': '十勝地方北部',
      '156': '十勝地方中部',
      '157': '十勝地方南部',
      '160': '釧路地方北部',
      '161': '釧路地方中南部',
      '165': '根室地方北部',
      '166': '根室地方中部',
      '167': '根室地方南部',
      '200': '青森県津軽北部',
      '201': '青森県津軽南部',
      '202': '青森県三八上北',
      '203': '青森県下北',
      '210': '岩手県沿岸北部',
      '211': '岩手県沿岸南部',
      '212': '岩手県内陸北部',
      '213': '岩手県内陸南部',
      '220': '宮城県北部',
      '221': '宮城県南部',
      '222': '宮城県中部',
      '230': '秋田県沿岸北部',
      '231': '秋田県沿岸南部',
      '232': '秋田県内陸北部',
      '233': '秋田県内陸南部',
      '240': '山形県庄内',
      '241': '山形県最上',
      '242': '山形県村山',
      '243': '山形県置賜',
      '250': '福島県中通り',
      '251': '福島県浜通り',
      '252': '福島県会津',
      '300': '茨城県北部',
      '301': '茨城県南部',
      '310': '栃木県北部',
      '311': '栃木県南部',
      '320': '群馬県北部',
      '321': '群馬県南部',
      '330': '埼玉県北部',
      '331': '埼玉県南部',
      '332': '埼玉県秩父',
      '340': '千葉県北東部',
      '341': '千葉県北西部',
      '342': '千葉県南部',
      '350': '東京都２３区',
      '351': '東京都多摩東部',
      '352': '東京都多摩西部',
      '354': '神津島',
      '355': '伊豆大島',
      '356': '新島',
      '357': '三宅島',
      '358': '八丈島',
      '359': '小笠原',
      '360': '神奈川県東部',
      '361': '神奈川県西部',
      '370': '新潟県上越',
      '371': '新潟県中越',
      '372': '新潟県下越',
      '375': '新潟県佐渡',
      '380': '富山県東部',
      '381': '富山県西部',
      '390': '石川県能登',
      '391': '石川県加賀',
      '400': '福井県嶺北',
      '401': '福井県嶺南',
      '411': '山梨県中・西部',
      '412': '山梨県東部・富士五湖',
      '420': '長野県北部',
      '421': '長野県中部',
      '422': '長野県南部',
      '430': '岐阜県飛騨',
      '431': '岐阜県美濃東部',
      '432': '岐阜県美濃中西部',
      '440': '静岡県伊豆',
      '441': '静岡県東部',
      '442': '静岡県中部',
      '443': '静岡県西部',
      '450': '愛知県東部',
      '451': '愛知県西部',
      '460': '三重県北部',
      '461': '三重県中部',
      '462': '三重県南部',
      '500': '滋賀県北部',
      '501': '滋賀県南部',
      '510': '京都府北部',
      '511': '京都府南部',
      '520': '大阪府北部',
      '521': '大阪府南部',
      '530': '兵庫県北部',
      '531': '兵庫県南東部',
      '532': '兵庫県南西部',
      '535': '兵庫県淡路島',
      '540': '奈良県',
      '550': '和歌山県北部',
      '551': '和歌山県南部',
      '560': '鳥取県東部',
      '562': '鳥取県中部',
      '563': '鳥取県西部',
      '570': '島根県東部',
      '571': '島根県西部',
      '575': '島根県隠岐',
      '580': '岡山県北部',
      '581': '岡山県南部',
      '590': '広島県北部',
      '591': '広島県南東部',
      '592': '広島県南西部',
      '600': '徳島県北部',
      '601': '徳島県南部',
      '610': '香川県東部',
      '611': '香川県西部',
      '620': '愛媛県東予',
      '621': '愛媛県中予',
      '622': '愛媛県南予',
      '630': '高知県東部',
      '631': '高知県中部',
      '632': '高知県西部',
      '700': '山口県北部',
      '702': '山口県西部',
      '703': '山口県東部',
      '704': '山口県中部',
      '710': '福岡県福岡',
      '711': '福岡県北九州',
      '712': '福岡県筑豊',
      '713': '福岡県筑後',
      '720': '佐賀県北部',
      '721': '佐賀県南部',
      '730': '長崎県北部',
      '731': '長崎県南西部',
      '732': '長崎県島原半島',
      '735': '長崎県対馬',
      '736': '長崎県壱岐',
      '737': '長崎県五島',
      '740': '熊本県阿蘇',
      '741': '熊本県熊本',
      '742': '熊本県球磨',
      '743': '熊本県天草・芦北',
      '750': '大分県北部',
      '751': '大分県中部',
      '752': '大分県南部',
      '753': '大分県西部',
      '760': '宮崎県北部平野部',
      '761': '宮崎県北部山沿い',
      '762': '宮崎県南部平野部',
      '763': '宮崎県南部山沿い',
      '770': '鹿児島県薩摩',
      '771': '鹿児島県大隅',
      '774': '鹿児島県十島村',
      '775': '鹿児島県甑島',
      '776': '鹿児島県種子島',
      '777': '鹿児島県屋久島',
      '778': '鹿児島県奄美北部',
      '779': '鹿児島県奄美南部',
      '800': '沖縄県本島北部',
      '801': '沖縄県本島中南部',
      '802': '沖縄県久米島',
      '803': '沖縄県大東島',
      '804': '沖縄県宮古島',
      '805': '沖縄県石垣島',
      '806': '沖縄県与那国島',
      '807': '沖縄県西表島'
    }[data[i]]);

    var intensity = '震度';
    if (data[i + 1].substr(3, 2) == '//') {
      intensity += toIntensity(data[i + 1].substr(1, 2)) + '程度以上';
    } else if (data[i + 1].substr(1, 2) == data[i + 1].substr(3, 2)) {
      intensity += toIntensity(data[i + 1].substr(1, 2)) + '程度';
    } else {
      intensity += toIntensity(data[i + 1].substr(3, 2)) + 'から';
      intensity += toIntensity(data[i + 1].substr(1, 2)) + '程度';
    }

    eew.ebi.push(intensity);

    if (data[i + 2] == '//////') {
      eew.ebi.push('');
    } else {
      eew.ebi.push(data[i + 2].substr(0, 2) + '時' + data[i + 2].substr(2, 2)  + '分' + data[i + 2].substr(4, 2)  + '秒');
    }
    
    eew.ebi.push({
      '0': '予報',
      '1': '警報',
      '/': '不明または未設定'
    }[data[i + 3].substr(0, 1)]);

    eew.ebi.push({
      '0': '未到達',
      '1': '既に到達と予測',
      '9': '主要動到達時刻の予測なし（PLUM法による予測）',
      '/': '不明または未設定'
    }[data[i + 3].substr(1, 1)]);
  }

  return eew;
}
